Repository: zackria/Z-Font-Analyzer
Catalog: Z Font Analyzer/*.lproj/Localizable.strings
Languages: ar

source: Dashboard
ar: لوحة القيادة

source: Fonts
ar: الخطوط

source: Files
ar: الملفات

source: Results
ar: النتائج

source: Settings
ar: الإعدادات

source: Select Directory
ar: اختر المجلد

source: Start Search
ar: بدء البحث

source: Cancel Search
ar: إلغاء البحث

source: Export
ar: تصدير

source: No directory selected
ar: لم يتم اختيار مجلد

# search_fonts_placeholder
source: Search fonts...
ar: البحث عن الخطوط...

source: Files Processed
ar: الملفات التي تمت معالجتها

source: Unique Fonts
ar: خطوط فريدة

source: File Types
ar: أنواع الملفات

source: File Types Distribution
ar: توزيع أنواع الملفات

source: Top Fonts Used
ar: الخطوط الأكثر استخداماً

source: Fonts Used
ar: الخطوط المستخدمة

source: Scanned Files
ar: الملفات الممسوحة

source: No Fonts Found
ar: لم يتم العثور على خطوط

source: No Matching Fonts
ar: لا توجد خطوط مطابقة

source: Done
ar: تم

source: Performance
ar: الأداء

source: Max Concurrent Operations
ar: العمليات المتزامنة القصوى

source: Search Options
ar: خيارات البحث

source: Skip Hidden Folders
ar: تخطي المجلدات المخفية

# language_picker
source: Language
ar: اللغة

# appearance_picker
source: Appearance
ar: المظهر

# theme_system
source: System
ar: النظام

# theme_light
source: Light
ar: فاتح

# theme_dark
source: Dark
ar: داكن

source: Export As
ar: تصدير كـ

# export_fonts_csv
source: Export Fonts Tab CSV
ar: تصدير تبويب الخطوط CSV

# export_fonts_json
source: Export Fonts Tab JSON
ar: تصدير تبويب الخطوط JSON

# export_files_csv
source: Export Files Tab CSV
ar: تصدير تبويب الملفات CSV

# export_files_json
source: Export Files Tab JSON
ar: تصدير تبويب الملفات JSON

source: Font Name
ar: اسم الخط

source: File Type
ar: نوع الملف

source: Description
ar: الوصف

source: Count
ar: العدد

source: File Path
ar: مسار الملف

source: File Name
ar: اسم الملف

source: Font
ar: الخط

# export_success
source: Exported successfully!
ar: تم التصدير بنجاح!

source: Export failed
ar: فشل التصدير

source: Starting search...
ar: بدء البحث...

# processing_files
source: Processing %d files...
ar: جاري معالجة %d ملفات...

# processed_status
source: Processed %d/%d files.
ar: تم معالجة %d/%d ملفات.

# search_complete
source: Search complete. Found %d font entries.
ar: اكتمل البحث. تم العثور على %d إدخالات للخطوط.

# no_target_files
source: No target files found.
ar: لم يتم العثور على ملفات مستهدفة.

# no_font_tags
source: No font tags found in the target files.
ar: لم يتم العثور على علامات خط في الملفات المستهدفة.

# invalid_directory
source: Invalid directory URL.
ar: عنوان المجلد غير صالح.

source: No Data Available
ar: لا تتوفر بيانات

source: Motion Title
ar: عنوان موشن

source: Motion Transition
ar: انتقال موشن

source: Motion Generator
ar: مولد موشن

source: Motion Effect
ar: تأثير موشن

source: Unknown
ar: غير معروف

# access_error
source: Could not access directory: %@
ar: لم يتمكن من الوصول إلى المجلد: %@

source: Font Exists
ar: الخط موجود

source: Real Font Name
ar: اسم الخط الحقيقي

# download_all
source: Download All Missing
ar: تنزيل جميع الخطوط المفقودة

source: Download
ar: تنزيل

source: Actions
ar: الإجراءات

# download_started
source: Font download request sent to system...
ar: تم إرسال طلب تنزيل الخط إلى النظام...

# download_finished
source: Font download process finished.
ar: انتهت عملية تنزيل الخط.

# download_not_found
source: Font '%@' not found on system servers. It must be installed manually.
ar: الخط '%@' غير موجود في خوادم النظام. يجب تثبيته يدوياً.

# download_failure_title
source: Download Incomplete
ar: التنزيل غير مكتمل

# download_failure_message
source: The following fonts were not found on Apple's servers and must be installed manually:
ar: لم يتم العثور على الخطوط التالية في خوادم Apple ويجب تثبيتها يدوياً:

source: Copy to Clipboard
ar: نسخ إلى الحافظة

source: Copied!
ar: تم النسخ!

# download_resources_title
source: Find missing fonts:
ar: العثور على الخطوط المفقودة:

# settings_general
source: General
ar: عام

# settings_performance_desc
source: Adjust how many files are scanned at once. Higher values are faster but use more CPU.
ar: ضبط عدد الملفات التي يتم فحصها دفعة واحدة. القيم الأعلى أسرع ولكنها تستخدم المزيد من المعالج.

# settings_search_desc
source: Configure how the analyzer looks through your project files.
ar: تكوين كيفية بحث المحلل في ملفات مشروعك.

# settings_language_desc
source: Choose the language for the application interface.
ar: اختر لغة واجهة التطبيق.

# settings_appearance_desc
source: Select a light or dark theme, or follow your Mac's system settings.
ar: حدد مظهراً فاتحاً أو داكناً، أو اتبع إعدادات نظام Mac الخاص بك.
